app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("created_at", "description", "name", "price_in_cents", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-10 21:32:32.921523"], ["description", "A new product by Maria"], ["name", "Maria's new product"], ["price_in_cents", 1000], ["updated_at", "2014-11-10 21:32:32.921523"]]