app/controllers/reviews_controller.rb

  def show
  	@review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 4]]

  def create
  	@review = @product.reviews.build(review_params)
  	@review.user = current_user # from Applications Controller?

  	if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "New review by AZ."], ["created_at", "2014-11-11 22:15:44.130714"], ["product_id", 4], ["updated_at", "2014-11-11 22:15:44.130714"], ["user_id", 1]]

  def load_product
  	@product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 4]]